* OpenTracker setup

  This shows how to configure [[http://erdgeist.org/arts/software/opentracker/][OpenTracker]] using a public Docker image:
  [[https://github.com/Lednerb/opentracker-docker][opentracker-docker]] 


** Create EC2 instance

   1. get a free-tier ec2 with 8gb of memory
   2. ssh into ec2 instance:

      #+begin_quote shell
      ssh -i opentracker.pem ec2-user@<eip>
      #+end_quote
        

*** EC2 access GOTCHAS

    1. Public IP changes: instances get a new ip after a stop/start
       cycle 
    2. Security Group rules: any security groups associate with your
       current ssh client won't work, unless the ssh clients have a
       stable public ip
       
       - to get your current public ip address:

         + Via ipinfo:

           #+begin_src bash
             curl ipinfo.io/ip
           #+end_src
  
           #+RESULTS:
           : 149.224.18.37
  
         + Via Amazon:
           
           #+begin_src bash
             curl checkip.amazonaws.com
           #+end_src
  
           #+RESULTS:
           : 149.224.18.37
         

** Install Docker on Amazon Linux
   
   1. yum install docker
   2. sudo amazon-linux-extras install docker
   3. sudo service docker start
   4. sudo usermod -a -G docker ec2-user
   5. sudo chkconfig docker on
   6. sudo yum install -y git
   7. sudo reboot


** Run OpenTracker on Docker
   :PROPERTIES:
   :ID:       C4CEDA6B-636A-4288-9F28-C6F5CDA8AB42
   :END:

   1. =ssh -i opentracker.pem ec2-user@<eip>=: login to ec2 instance 
   2. =docker container prune=, delete all stopped containers
   3. =sudo service docker start=: start Docker engine
   4. =docker run -d --name opentracker -p 6969:6969/udp -p 6969:6969 lednerb/opentracker-docker=
      Run OpenTracker docker image:
   5. netcat:
      - =sudo yum install nc=: install =netcat=
      - =nc -vz hostname 6969=: test opentracker port
   6. Docker:
      - =docker ps=: list running containers
      - =docker logs -f <id>=: tail logs of container =id=


** Creating a torrent GOTCHAS

   1. Create a *public* torrent
      - although it's our own Torrent tracker, it's still public
      - set the tracker URL to =http://<eip>:6969/announce=
        + the port needs to match whatever was used when starting the
          opentracker container, see: [[id:C4CEDA6B-636A-4288-9F28-C6F5CDA8AB42][Run OpenTracker on Docker]]
   2. Ensure that the shared file is completely downloaded
      - if it's not, then use the locate files function in your
        Torrent client
      - you cannot start seeding until you have fully downloaded the
        file once
   3. Generate /Magnet Link/ and share with your friend
        

** Related

*** Install Docker in Amazon Linux: [[https://gist.github.com/npearce/6f3c7826c7499587f00957fee62f8ee9][github gist]]
   
*** opentracker: [[https://erdgeist.org/arts/software/opentracker/][website]]

*** Docker image for opentracker: [[https://github.com/Lednerb/opentracker-docker][github]]

*** How to make your own torrents: [[https://www.youtube.com/watch?v=fHrsx7bbVY8&ab_channel=DeAndreQueary][youtube]]

